In [11]:
import pandas as pd
import numpy as np

b1 = pd.read_csv('basic1.csv')
print(b1.head())
print(b1.shape)

     id   age city    f1  f2   f3    f4         f5
0  id01   2.0   서울   NaN   0  NaN  ENFJ  91.297791
1  id02   9.0   서울  70.0   1  NaN  ENFJ  60.339826
2  id03  27.0   서울  61.0   1  NaN  ISTJ  17.252986
3  id04  75.0   서울   NaN   2  NaN  INFP  52.667078
4  id05  24.0   서울  85.0   2  NaN  ISFJ  29.269869
(100, 8)

In [12]:
#f1 결측 제거
b1 = b1.dropna(subset=['f1'])
print(b1.shape)

(69, 8)

In [14]:
#city와 f2를 묶어 그룹핑
b2 = b1.groupby(['city','f2']).sum()
b2.head()

           age     f1          f5
city f2
경기   0   720.4  833.0  943.944823
     1   696.0  670.0  657.241212
     2   239.0  311.0  362.300060
대구   0   387.0  527.0  183.199568
     1   217.6  235.0  241.333824

In [17]:
#city가 경기이고 f2가 0인 f1컬럼
b2.iloc[0]['f1']

833.0